

clc,clear,close all
y = [6.052707615000000   6.111204297000000   6.249562064000000   6.474179872000000   6.653505231000000 6.820288378000000   7.025521663000000   7.823715606000000   8.121950753000000];
%建立符号变量a(发展系数)和b(灰作用量)
syms a b;
c = [a b]';

%原始数列 A
A=y; %input('请输入原始序列(格式为[1.5, 2.1, 3.3, 4.6, 5.7]): ');
m=5; %input('请输入后续需要预测的数据个数: ');
n = length(A);

max_i = 0;
max_j = 0;
max_p = -1;
min_c = 1;
min_i = 0;
min_j = 0;
for j_1 = 0:0.01:10
    for i_1 = 0:0.01:10
        %对原始数列 A 做累加得到数列 B
        B = cumsum(A);
        
        %对数列 B 做紧邻均值生成
        for i = 2:n
            C(i) = (B(i) + B(i - 1))/2; 
        end
        C(1) = [];
        
        %构造数据矩阵 
        B = [-C;ones(1,n-1)];
        Y = A; Y(1) = []; Y = Y';
        
        %使用最小二乘法计算参数 a(发展系数)和b(灰作用量)
        c = inv(B*B')*B*Y;
        c = c';
        a = c(1); b = c(2);
        
        %预测后续数据
        F = []; F(1) = A(1);
        for i = 2:(n+m)
            F(i) = (A(1)-b/a)/i_1^(a*(i-1+j_1))+ b/a;
        end
        
        %对数列 F 累减还原,得到预测出的数据
        G = []; G(1) = A(1);
        for i = 2:(n+m)
            G(i) = F(i) - F(i-1); %得到预测出来的数据
        end
        
        
        
        %模型检验
        
        H = G(1:n);
        %计算残差序列
        epsilon = A - H;
        
        %方差比C检验
        C = std(epsilon, 1)/std(A, 1);
        
        if(min_c>C)
            min_c = C;
            min_i =     
        end
        if C<0.35
            disp('系统预测精度好')
            disp(i_1);
            disp(j_1);
        else if C<0.5
            disp('系统预测精度合格')
            disp(i_1);
            disp(j_1);
                
        end
        end
                
    end
end





